podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK64F12.h
/**
 * @file      PinMapping.h
 * @version   1.0.0
 * @brief     Pin declarations for MK64F12
 */

#ifndef PINMAPPING_H_
#define PINMAPPING_H_

#include "derivative.h"

//-------- <<< Use Configuration Wizard in Context Menu >>> -----------------  

// <h> FTM Clock settings

// FTM_SC.CLKS ================================
//
//   <o> FTM_SC.CLKS Clock source 
//   <i> Selects the clock source for the FTM module. [FTM_SC.CLKS]
//     <0=> Disabled
//     <1=> System clock
//     <2=> Fixed frequency clock
//     <3=> External clock
//     <1=> Default
// FTM_SC.PS ================================
//
//   <o1> FTM_SC.PS Clock prescaler 
//   <i> Selects the prescaler for the FTM module. [FTM_SC.PS]
//     <0=> Divide by 1
//     <1=> Divide by 2
//     <2=> Divide by 4
//     <3=> Divide by 8
//     <4=> Divide by 16
//     <5=> Divide by 32
//     <6=> Divide by 64
//     <7=> Divide by 128
//     <0=> Default
#define FTM_SC               (FTM_SC_CLKS(0x1)|FTM_SC_PS(0x0))

// </h>

#define ADC0_CLOCK_REG       SIM->SCGC6          
#define ADC0_CLOCK_MASK      SIM_SCGC6_ADC0_MASK 
#define ADC1_CLOCK_REG       SIM->SCGC3          
#define ADC1_CLOCK_MASK      SIM_SCGC3_ADC1_MASK 
#define SDHC0_CLOCK_REG      SIM->SCGC3          
#define SDHC0_CLOCK_MASK     SIM_SCGC3_SDHC0_MASK
#define I2C0_CLOCK_REG       SIM->SCGC4          
#define I2C0_CLOCK_MASK      SIM_SCGC4_I2C0_MASK 
#define I2C1_CLOCK_REG       SIM->SCGC4          
#define I2C1_CLOCK_MASK      SIM_SCGC4_I2C1_MASK 
#define I2C2_CLOCK_REG       SIM->SCGC1          
#define I2C2_CLOCK_MASK      SIM_SCGC1_I2C2_MASK 
#define SPI0_CLOCK_REG       SIM->SCGC6          
#define SPI0_CLOCK_MASK      SIM_SCGC6_SPI0_MASK 
#define SPI1_CLOCK_REG       SIM->SCGC6          
#define SPI1_CLOCK_MASK      SIM_SCGC6_SPI1_MASK 
#define SPI2_CLOCK_REG       SIM->SCGC3          
#define SPI2_CLOCK_MASK      SIM_SCGC3_SPI2_MASK 
#define FTM0_CLOCK_REG       SIM->SCGC6          
#define FTM0_CLOCK_MASK      SIM_SCGC6_FTM0_MASK 
#define FTM1_CLOCK_REG       SIM->SCGC6          
#define FTM1_CLOCK_MASK      SIM_SCGC6_FTM1_MASK 
#define FTM2_CLOCK_REG       SIM->SCGC3          
#define FTM2_CLOCK_MASK      SIM_SCGC3_FTM2_MASK 
#define FTM3_CLOCK_REG       SIM->SCGC3          
#define FTM3_CLOCK_MASK      SIM_SCGC3_FTM3_MASK 

// <h> Pin Peripheral mapping

// ADC0_10 maps to [Disabled, PTA7]
//   <o> ADC0_10 Pin Selection [PTA7] <constant>
//   <i> Selects which pin is used for ADC0_10
//     <0=> Disabled
//     <1=> PTA7
//     <1=> Default
#define ADC0_10_SEL          1                   

// ADC0_11 maps to [Disabled, PTA8]
//   <o> ADC0_11 Pin Selection [PTA8] <constant>
//   <i> Selects which pin is used for ADC0_11
//     <0=> Disabled
//     <1=> PTA8
//     <1=> Default
#define ADC0_11_SEL          1                   

// ADC0_12 maps to [Disabled, PTB2]
//   <o> ADC0_12 Pin Selection [PTB2(A0)] <constant>
//   <i> Selects which pin is used for ADC0_12
//     <0=> Disabled
//     <1=> PTB2 (Alias: A0)
//     <1=> Default
#define ADC0_12_SEL          1                   

// ADC0_13 maps to [Disabled, PTB3]
//   <o> ADC0_13 Pin Selection [PTB3(A1)] <constant>
//   <i> Selects which pin is used for ADC0_13
//     <0=> Disabled
//     <1=> PTB3 (Alias: A1)
//     <1=> Default
#define ADC0_13_SEL          1                   

// ADC0_14 maps to [Disabled, PTC0]
//   <o> ADC0_14 Pin Selection [PTC0] <constant>
//   <i> Selects which pin is used for ADC0_14
//     <0=> Disabled
//     <1=> PTC0
//     <1=> Default
#define ADC0_14_SEL          1                   

// ADC0_15 maps to [Disabled, PTC1]
//   <o> ADC0_15 Pin Selection [PTC1] <constant>
//   <i> Selects which pin is used for ADC0_15
//     <0=> Disabled
//     <1=> PTC1
//     <1=> Default
#define ADC0_15_SEL          1                   

// ADC0_17 maps to [Disabled, PTE24]
//   <o> ADC0_17 Pin Selection [PTE24(D15)] <constant>
//   <i> Selects which pin is used for ADC0_17
//     <0=> Disabled
//     <1=> PTE24 (Alias: D15)
//     <1=> Default
#define ADC0_17_SEL          1                   

// ADC0_18 maps to [Disabled, PTE25]
//   <o> ADC0_18 Pin Selection [PTE25(D14)] <constant>
//   <i> Selects which pin is used for ADC0_18
//     <0=> Disabled
//     <1=> PTE25 (Alias: D14)
//     <1=> Default
#define ADC0_18_SEL          1                   

// ADC0_21 maps to [Disabled, ADC0_SE16]
//   <o> ADC0_21 Pin Selection [ADC0_SE16] <constant>
//   <i> Selects which pin is used for ADC0_21
//     <0=> Disabled
//     <1=> ADC0_SE16
//     <1=> Default
#define ADC0_21_SEL          1                   

// ADC0_22 maps to [Disabled, ADC1_SE16]
//   <o> ADC0_22 Pin Selection [ADC1_SE16] <constant>
//   <i> Selects which pin is used for ADC0_22
//     <0=> Disabled
//     <1=> ADC1_SE16
//     <1=> Default
#define ADC0_22_SEL          1                   

// ADC0_23 maps to [Disabled, ADC0_SE23]
//   <o> ADC0_23 Pin Selection [ADC0_SE23] <constant>
//   <i> Selects which pin is used for ADC0_23
//     <0=> Disabled
//     <1=> ADC0_SE23
//     <1=> Default
#define ADC0_23_SEL          1                   

// ADC0_4 maps to [Disabled, PTC2]
//   <o> ADC0_4 Pin Selection [PTC2(D6)] <constant>
//   <i> Selects which pin is used for ADC0_4
//     <0=> Disabled
//     <1=> PTC2 (Alias: D6)
//     <1=> Default
#define ADC0_4_SEL           1                   

// ADC0_5 maps to [Disabled, PTD1]
//   <o> ADC0_5 Pin Selection [PTD1(D13)] <constant>
//   <i> Selects which pin is used for ADC0_5
//     <0=> Disabled
//     <1=> PTD1 (Alias: D13)
//     <1=> Default
#define ADC0_5_SEL           1                   

// ADC0_6 maps to [Disabled, PTD5]
//   <o> ADC0_6 Pin Selection [PTD5(nRF24L01_sck)] <constant>
//   <i> Selects which pin is used for ADC0_6
//     <0=> Disabled
//     <1=> PTD5 (Alias: nRF24L01_sck)
//     <1=> Default
#define ADC0_6_SEL           1                   

// ADC0_7 maps to [Disabled, PTD6]
//   <o> ADC0_7 Pin Selection [PTD6(nRF24L01_mosi)] <constant>
//   <i> Selects which pin is used for ADC0_7
//     <0=> Disabled
//     <1=> PTD6 (Alias: nRF24L01_mosi)
//     <1=> Default
#define ADC0_7_SEL           1                   

// ADC1_10 maps to [Disabled, PTB4]
//   <o> ADC1_10 Pin Selection [PTB4] <constant>
//   <i> Selects which pin is used for ADC1_10
//     <0=> Disabled
//     <1=> PTB4
//     <1=> Default
#define ADC1_10_SEL          1                   

// ADC1_11 maps to [Disabled, PTB5]
//   <o> ADC1_11 Pin Selection [PTB5] <constant>
//   <i> Selects which pin is used for ADC1_11
//     <0=> Disabled
//     <1=> PTB5
//     <1=> Default
#define ADC1_11_SEL          1                   

