podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK64F12.h
// ADC1_12 maps to [Disabled, PTB6]
//   <o> ADC1_12 Pin Selection [PTB6] <constant>
//   <i> Selects which pin is used for ADC1_12
//     <0=> Disabled
//     <1=> PTB6
//     <1=> Default
#define ADC1_12_SEL          1                   

// ADC1_13 maps to [Disabled, PTB7]
//   <o> ADC1_13 Pin Selection [PTB7] <constant>
//   <i> Selects which pin is used for ADC1_13
//     <0=> Disabled
//     <1=> PTB7
//     <1=> Default
#define ADC1_13_SEL          1                   

// ADC1_14 maps to [Disabled, PTB10]
//   <o> ADC1_14 Pin Selection [PTB10(A2)] <constant>
//   <i> Selects which pin is used for ADC1_14
//     <0=> Disabled
//     <1=> PTB10 (Alias: A2)
//     <1=> Default
#define ADC1_14_SEL          1                   

// ADC1_15 maps to [Disabled, PTB11]
//   <o> ADC1_15 Pin Selection [PTB11(A3)] <constant>
//   <i> Selects which pin is used for ADC1_15
//     <0=> Disabled
//     <1=> PTB11 (Alias: A3)
//     <1=> Default
#define ADC1_15_SEL          1                   

// ADC1_17 maps to [Disabled, PTA17]
//   <o> ADC1_17 Pin Selection [PTA17] <constant>
//   <i> Selects which pin is used for ADC1_17
//     <0=> Disabled
//     <1=> PTA17
//     <1=> Default
#define ADC1_17_SEL          1                   

// ADC1_18 maps to [Disabled, ADC1_SE18]
//   <o> ADC1_18 Pin Selection [ADC1_SE18] <constant>
//   <i> Selects which pin is used for ADC1_18
//     <0=> Disabled
//     <1=> ADC1_SE18
//     <1=> Default
#define ADC1_18_SEL          1                   

// ADC1_23 maps to [Disabled, ADC1_SE23]
//   <o> ADC1_23 Pin Selection [ADC1_SE23] <constant>
//   <i> Selects which pin is used for ADC1_23
//     <0=> Disabled
//     <1=> ADC1_SE23
//     <1=> Default
#define ADC1_23_SEL          1                   

// ADC1_4 maps to [Disabled, PTC8]
//   <o> ADC1_4 Pin Selection [PTC8] <constant>
//   <i> Selects which pin is used for ADC1_4
//     <0=> Disabled
//     <1=> PTC8
//     <1=> Default
#define ADC1_4_SEL           1                   

// ADC1_5 maps to [Disabled, PTC9]
//   <o> ADC1_5 Pin Selection [PTC9] <constant>
//   <i> Selects which pin is used for ADC1_5
//     <0=> Disabled
//     <1=> PTC9
//     <1=> Default
#define ADC1_5_SEL           1                   

// ADC1_6 maps to [Disabled, PTC10]
//   <o> ADC1_6 Pin Selection [PTC10(A5)] <constant>
//   <i> Selects which pin is used for ADC1_6
//     <0=> Disabled
//     <1=> PTC10 (Alias: A5)
//     <1=> Default
#define ADC1_6_SEL           1                   

// ADC1_7 maps to [Disabled, PTC11]
//   <o> ADC1_7 Pin Selection [PTC11(A4)] <constant>
//   <i> Selects which pin is used for ADC1_7
//     <0=> Disabled
//     <1=> PTC11 (Alias: A4)
//     <1=> Default
#define ADC1_7_SEL           1                   

// ADC1_8 maps to [Disabled, PTB0]
//   <o> ADC1_8 Pin Selection [PTB0] <constant>
//   <i> Selects which pin is used for ADC1_8
//     <0=> Disabled
//     <1=> PTB0
//     <1=> Default
#define ADC1_8_SEL           1                   

// ADC1_9 maps to [Disabled, PTB1]
//   <o> ADC1_9 Pin Selection [PTB1] <constant>
//   <i> Selects which pin is used for ADC1_9
//     <0=> Disabled
//     <1=> PTB1
//     <1=> Default
#define ADC1_9_SEL           1                   

// FTM0_0 maps to [Disabled, PTA3, PTC1]
//   <o> FTM0_0 Pin Selection [PTA3, PTC1] 
//   <i> Selects which pin is used for FTM0_0
//     <0=> Disabled
//     <1=> PTA3
//     <2=> PTC1
//     <2=> Default
#define FTM0_0_SEL           2                   

// FTM0_1 maps to [Disabled, PTA4, PTC2]
//   <o> FTM0_1 Pin Selection [PTA4, PTC2(D6)] 
//   <i> Selects which pin is used for FTM0_1
//     <0=> Disabled
//     <1=> PTA4
//     <2=> PTC2 (Alias: D6)
//     <2=> Default
#define FTM0_1_SEL           2                   

// FTM0_2 maps to [Disabled, PTA5, PTC3, PTC5]
//   <o> FTM0_2 Pin Selection [PTA5, PTC3(D7), PTC5] 
//   <i> Selects which pin is used for FTM0_2
//     <0=> Disabled
//     <1=> PTA5
//     <2=> PTC3 (Alias: D7)
//     <3=> PTC5
//     <2=> Default
#define FTM0_2_SEL           2                   

// FTM0_3 maps to [Disabled, PTA6, PTC4]
//   <o> FTM0_3 Pin Selection [PTA6, PTC4(D9)] 
//   <i> Selects which pin is used for FTM0_3
//     <0=> Disabled
//     <1=> PTA6
//     <2=> PTC4 (Alias: D9)
//     <2=> Default
#define FTM0_3_SEL           2                   

// FTM0_4 maps to [Disabled, PTA7, PTB12, PTD4]
//   <o> FTM0_4 Pin Selection [PTA7, PTB12, PTD4(nRF24L01_cs)] 
//   <i> Selects which pin is used for FTM0_4
//     <0=> Disabled
//     <1=> PTA7
//     <2=> PTB12
//     <3=> PTD4 (Alias: nRF24L01_cs)
//     <1=> Default
#define FTM0_4_SEL           1                   

// FTM0_5 maps to [Disabled, PTA0, PTB13, PTD5]
//   <o> FTM0_5 Pin Selection [PTA0(D8), PTB13, PTD5(nRF24L01_sck)] 
//   <i> Selects which pin is used for FTM0_5
//     <0=> Disabled
//     <1=> PTA0 (Alias: D8)
//     <2=> PTB13
//     <3=> PTD5 (Alias: nRF24L01_sck)
//     <1=> Default
#define FTM0_5_SEL           1                   

// FTM0_6 maps to [Disabled, PTA1, PTD6]
//   <o> FTM0_6 Pin Selection [PTA1(D3), PTD6(nRF24L01_mosi)] 
//   <i> Selects which pin is used for FTM0_6
//     <0=> Disabled
//     <1=> PTA1 (Alias: D3)
//     <2=> PTD6 (Alias: nRF24L01_mosi)
//     <1=> Default
#define FTM0_6_SEL           1                   

// FTM0_7 maps to [Disabled, PTA2, PTD7]
//   <o> FTM0_7 Pin Selection [PTA2(D5), PTD7(nRF24L01_miso)] 
//   <i> Selects which pin is used for FTM0_7
//     <0=> Disabled
//     <1=> PTA2 (Alias: D5)
//     <2=> PTD7 (Alias: nRF24L01_miso)
//     <1=> Default
#define FTM0_7_SEL           1                   

// FTM1_0 maps to [Disabled, PTA8, PTA12, PTB0, PTB12]
//   <o> FTM1_0 Pin Selection [PTA8, PTA12, PTB0, PTB12] 
//   <i> Selects which pin is used for FTM1_0
//     <0=> Disabled
//     <1=> PTA8
//     <2=> PTA12
//     <3=> PTB0
//     <4=> PTB12
//     <1=> Default
#define FTM1_0_SEL           1                   

// FTM1_1 maps to [Disabled, PTA9, PTA13, PTB1, PTB13]
//   <o> FTM1_1 Pin Selection [PTA9, PTA13, PTB1, PTB13] 
//   <i> Selects which pin is used for FTM1_1
//     <0=> Disabled
//     <1=> PTA9
//     <2=> PTA13
//     <3=> PTB1
//     <4=> PTB13
//     <1=> Default
#define FTM1_1_SEL           1                   

// FTM2_0 maps to [Disabled, PTA10, PTB18]
//   <o> FTM2_0 Pin Selection [PTA10, PTB18] 
//   <i> Selects which pin is used for FTM2_0
//     <0=> Disabled
//     <1=> PTA10
//     <2=> PTB18
//     <1=> Default
#define FTM2_0_SEL           1                   

// FTM2_1 maps to [Disabled, PTA11, PTB19]
//   <o> FTM2_1 Pin Selection [PTA11, PTB19] 
//   <i> Selects which pin is used for FTM2_1
//     <0=> Disabled
//     <1=> PTA11
//     <2=> PTB19
//     <1=> Default
#define FTM2_1_SEL           1                   

// FTM3_0 maps to [Disabled, PTD0, PTE5]
//   <o> FTM3_0 Pin Selection [PTD0(D10), PTE5] 
//   <i> Selects which pin is used for FTM3_0
//     <0=> Disabled
//     <1=> PTD0 (Alias: D10)
//     <2=> PTE5
//     <1=> Default
#define FTM3_0_SEL           1                   

// FTM3_1 maps to [Disabled, PTD1, PTE6]
//   <o> FTM3_1 Pin Selection [PTD1(D13), PTE6] 
//   <i> Selects which pin is used for FTM3_1
//     <0=> Disabled
//     <1=> PTD1 (Alias: D13)
//     <2=> PTE6
//     <1=> Default
#define FTM3_1_SEL           1                   

