podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK64F12.h
// FTM3_2 maps to [Disabled, PTD2, PTE7]
//   <o> FTM3_2 Pin Selection [PTD2(D11), PTE7] 
//   <i> Selects which pin is used for FTM3_2
//     <0=> Disabled
//     <1=> PTD2 (Alias: D11)
//     <2=> PTE7
//     <1=> Default
#define FTM3_2_SEL           1                   

// FTM3_3 maps to [Disabled, PTD3, PTE8]
//   <o> FTM3_3 Pin Selection [PTD3(D12), PTE8] 
//   <i> Selects which pin is used for FTM3_3
//     <0=> Disabled
//     <1=> PTD3 (Alias: D12)
//     <2=> PTE8
//     <1=> Default
#define FTM3_3_SEL           1                   

// FTM3_4 maps to [Disabled, PTC8, PTE9]
//   <o> FTM3_4 Pin Selection [PTC8, PTE9] 
//   <i> Selects which pin is used for FTM3_4
//     <0=> Disabled
//     <1=> PTC8
//     <2=> PTE9
//     <1=> Default
#define FTM3_4_SEL           1                   

// FTM3_5 maps to [Disabled, PTC9, PTE10]
//   <o> FTM3_5 Pin Selection [PTC9, PTE10] 
//   <i> Selects which pin is used for FTM3_5
//     <0=> Disabled
//     <1=> PTC9
//     <2=> PTE10
//     <1=> Default
#define FTM3_5_SEL           1                   

// FTM3_6 maps to [Disabled, PTC10, PTE11]
//   <o> FTM3_6 Pin Selection [PTC10(A5), PTE11] 
//   <i> Selects which pin is used for FTM3_6
//     <0=> Disabled
//     <1=> PTC10 (Alias: A5)
//     <2=> PTE11
//     <1=> Default
#define FTM3_6_SEL           1                   

// FTM3_7 maps to [Disabled, PTC11, PTE12]
//   <o> FTM3_7 Pin Selection [PTC11(A4), PTE12] 
//   <i> Selects which pin is used for FTM3_7
//     <0=> Disabled
//     <1=> PTC11 (Alias: A4)
//     <2=> PTE12
//     <1=> Default
#define FTM3_7_SEL           1                   

// I2C0_SCL maps to [Disabled, PTB0, PTB2, PTD2, PTD8, PTE24]
//   <o> I2C0_SCL Pin Selection [PTB0, PTB2(A0), PTD2(D11), PTD8, PTE24(D15)] 
//   <i> Selects which pin is used for I2C0_SCL
//     <0=> Disabled
//     <1=> PTB0
//     <2=> PTB2 (Alias: A0)
//     <3=> PTD2 (Alias: D11)
//     <4=> PTD8
//     <5=> PTE24 (Alias: D15)
//     <5=> Default
#define I2C0_SCL_SEL         5                   

// I2C0_SDA maps to [Disabled, PTB1, PTB3, PTD3, PTD9, PTE25]
//   <o> I2C0_SDA Pin Selection [PTB1, PTB3(A1), PTD3(D12), PTD9, PTE25(D14)] 
//   <i> Selects which pin is used for I2C0_SDA
//     <0=> Disabled
//     <1=> PTB1
//     <2=> PTB3 (Alias: A1)
//     <3=> PTD3 (Alias: D12)
//     <4=> PTD9
//     <5=> PTE25 (Alias: D14)
//     <5=> Default
#define I2C0_SDA_SEL         5                   

// I2C1_SCL maps to [Disabled, PTC10, PTE1]
//   <o> I2C1_SCL Pin Selection [PTC10(A5), PTE1] 
//   <i> Selects which pin is used for I2C1_SCL
//     <0=> Disabled
//     <1=> PTC10 (Alias: A5)
//     <2=> PTE1
//     <1=> Default
#define I2C1_SCL_SEL         1                   

// I2C1_SDA maps to [Disabled, PTC11, PTE0]
//   <o> I2C1_SDA Pin Selection [PTC11(A4), PTE0] 
//   <i> Selects which pin is used for I2C1_SDA
//     <0=> Disabled
//     <1=> PTC11 (Alias: A4)
//     <2=> PTE0
//     <1=> Default
#define I2C1_SDA_SEL         1                   

// I2C2_SCL maps to [Disabled, PTA12, PTA14]
//   <o> I2C2_SCL Pin Selection [PTA12, PTA14] 
//   <i> Selects which pin is used for I2C2_SCL
//     <0=> Disabled
//     <1=> PTA12
//     <2=> PTA14
//     <1=> Default
#define I2C2_SCL_SEL         1                   

// I2C2_SDA maps to [Disabled, PTA11, PTA13]
//   <o> I2C2_SDA Pin Selection [PTA11, PTA13] 
//   <i> Selects which pin is used for I2C2_SDA
//     <0=> Disabled
//     <1=> PTA11
//     <2=> PTA13
//     <1=> Default
#define I2C2_SDA_SEL         1                   

// SDHC0_CLKIN maps to [Disabled, PTD11]
//   <o> SDHC0_CLKIN Pin Selection [PTD11] 
//   <i> Selects which pin is used for SDHC0_CLKIN
//     <0=> Disabled
//     <1=> PTD11
//     <0=> Default
#define SDHC0_CLKIN_SEL      0                   

// SDHC0_CMD maps to [Disabled, PTE3]
//   <o> SDHC0_CMD Pin Selection [PTE3] 
//   <i> Selects which pin is used for SDHC0_CMD
//     <0=> Disabled
//     <1=> PTE3
//     <0=> Default
#define SDHC0_CMD_SEL        0                   

// SDHC0_D0 maps to [Disabled, PTE1]
//   <o> SDHC0_D0 Pin Selection [PTE1] 
//   <i> Selects which pin is used for SDHC0_D0
//     <0=> Disabled
//     <1=> PTE1
//     <0=> Default
#define SDHC0_D0_SEL         0                   

// SDHC0_D1 maps to [Disabled, PTE0]
//   <o> SDHC0_D1 Pin Selection [PTE0] 
//   <i> Selects which pin is used for SDHC0_D1
//     <0=> Disabled
//     <1=> PTE0
//     <0=> Default
#define SDHC0_D1_SEL         0                   

// SDHC0_D2 maps to [Disabled, PTE5]
//   <o> SDHC0_D2 Pin Selection [PTE5] 
//   <i> Selects which pin is used for SDHC0_D2
//     <0=> Disabled
//     <1=> PTE5
//     <0=> Default
#define SDHC0_D2_SEL         0                   

// SDHC0_D3 maps to [Disabled, PTE4]
//   <o> SDHC0_D3 Pin Selection [PTE4] 
//   <i> Selects which pin is used for SDHC0_D3
//     <0=> Disabled
//     <1=> PTE4
//     <0=> Default
#define SDHC0_D3_SEL         0                   

// SDHC0_D4 maps to [Disabled, PTD12]
//   <o> SDHC0_D4 Pin Selection [PTD12] 
//   <i> Selects which pin is used for SDHC0_D4
//     <0=> Disabled
//     <1=> PTD12
//     <0=> Default
#define SDHC0_D4_SEL         0                   

// SDHC0_D5 maps to [Disabled, PTD13]
//   <o> SDHC0_D5 Pin Selection [PTD13] 
//   <i> Selects which pin is used for SDHC0_D5
//     <0=> Disabled
//     <1=> PTD13
//     <0=> Default
#define SDHC0_D5_SEL         0                   

// SDHC0_D6 maps to [Disabled, PTD14]
//   <o> SDHC0_D6 Pin Selection [PTD14] 
//   <i> Selects which pin is used for SDHC0_D6
//     <0=> Disabled
//     <1=> PTD14
//     <0=> Default
#define SDHC0_D6_SEL         0                   

// SDHC0_D7 maps to [Disabled, PTD15]
//   <o> SDHC0_D7 Pin Selection [PTD15] 
//   <i> Selects which pin is used for SDHC0_D7
//     <0=> Disabled
//     <1=> PTD15
//     <0=> Default
#define SDHC0_D7_SEL         0                   

// SDHC0_DCLK maps to [Disabled, PTE2]
//   <o> SDHC0_DCLK Pin Selection [PTE2] 
//   <i> Selects which pin is used for SDHC0_DCLK
//     <0=> Disabled
//     <1=> PTE2
//     <0=> Default
#define SDHC0_DCLK_SEL       0                   

// SPI0_PCS0 maps to [Disabled, PTA14, PTC4, PTD0]
//   <o> SPI0_PCS0 Pin Selection [PTA14, PTC4(D9), PTD0(D10)] 
//   <i> Selects which pin is used for SPI0_PCS0
//     <0=> Disabled
//     <1=> PTA14
//     <2=> PTC4 (Alias: D9)
//     <3=> PTD0 (Alias: D10)
//     <0=> Default
#define SPI0_PCS0_SEL        0                   

// SPI0_PCS1 maps to [Disabled, PTC3, PTD4]
//   <o> SPI0_PCS1 Pin Selection [PTC3(D7), PTD4(nRF24L01_cs)] 
//   <i> Selects which pin is used for SPI0_PCS1
//     <0=> Disabled
//     <1=> PTC3 (Alias: D7)
//     <2=> PTD4 (Alias: nRF24L01_cs)
//     <0=> Default
#define SPI0_PCS1_SEL        0                   

// SPI0_PCS2 maps to [Disabled, PTC2, PTD5]
//   <o> SPI0_PCS2 Pin Selection [PTC2(D6), PTD5(nRF24L01_sck)] 
//   <i> Selects which pin is used for SPI0_PCS2
//     <0=> Disabled
//     <1=> PTC2 (Alias: D6)
//     <2=> PTD5 (Alias: nRF24L01_sck)
//     <0=> Default
#define SPI0_PCS2_SEL        0                   

// SPI0_PCS3 maps to [Disabled, PTC1, PTD6]
//   <o> SPI0_PCS3 Pin Selection [PTC1, PTD6(nRF24L01_mosi)] 
//   <i> Selects which pin is used for SPI0_PCS3
//     <0=> Disabled
//     <1=> PTC1
//     <2=> PTD6 (Alias: nRF24L01_mosi)
//     <0=> Default
#define SPI0_PCS3_SEL        0                   

