podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK64F12.h
// SPI0_PCS4 maps to [Disabled, PTC0]
//   <o> SPI0_PCS4 Pin Selection [PTC0] 
//   <i> Selects which pin is used for SPI0_PCS4
//     <0=> Disabled
//     <1=> PTC0
//     <0=> Default
#define SPI0_PCS4_SEL        0                   

// SPI0_PCS5 maps to [Disabled, PTB23]
//   <o> SPI0_PCS5 Pin Selection [PTB23(D4)] 
//   <i> Selects which pin is used for SPI0_PCS5
//     <0=> Disabled
//     <1=> PTB23 (Alias: D4)
//     <0=> Default
#define SPI0_PCS5_SEL        0                   

// SPI0_SCK maps to [Disabled, PTA15, PTC5, PTD1]
//   <o> SPI0_SCK Pin Selection [PTA15, PTC5, PTD1(D13)] 
//   <i> Selects which pin is used for SPI0_SCK
//     <0=> Disabled
//     <1=> PTA15
//     <2=> PTC5
//     <3=> PTD1 (Alias: D13)
//     <3=> Default
#define SPI0_SCK_SEL         3                   

// SPI0_SIN maps to [Disabled, PTA17, PTC7, PTD3]
//   <o> SPI0_SIN Pin Selection [PTA17, PTC7, PTD3(D12)] 
//   <i> Selects which pin is used for SPI0_SIN
//     <0=> Disabled
//     <1=> PTA17
//     <2=> PTC7
//     <3=> PTD3 (Alias: D12)
//     <3=> Default
#define SPI0_SIN_SEL         3                   

// SPI0_SOUT maps to [Disabled, PTA16, PTC6, PTD2]
//   <o> SPI0_SOUT Pin Selection [PTA16, PTC6, PTD2(D11)] 
//   <i> Selects which pin is used for SPI0_SOUT
//     <0=> Disabled
//     <1=> PTA16
//     <2=> PTC6
//     <3=> PTD2 (Alias: D11)
//     <3=> Default
#define SPI0_SOUT_SEL        3                   

// SPI1_PCS0 maps to [Disabled, PTB10, PTD4, PTE4]
//   <o> SPI1_PCS0 Pin Selection [PTB10(A2), PTD4(nRF24L01_cs), PTE4] 
//   <i> Selects which pin is used for SPI1_PCS0
//     <0=> Disabled
//     <1=> PTB10 (Alias: A2)
//     <2=> PTD4 (Alias: nRF24L01_cs)
//     <3=> PTE4
//     <2=> Default
#define SPI1_PCS0_SEL        2                   

// SPI1_PCS1 maps to [Disabled, PTB9, PTE0]
//   <o> SPI1_PCS1 Pin Selection [PTB9(D2), PTE0] 
//   <i> Selects which pin is used for SPI1_PCS1
//     <0=> Disabled
//     <1=> PTB9 (Alias: D2)
//     <2=> PTE0
//     <0=> Default
#define SPI1_PCS1_SEL        0                   

// SPI1_PCS2 maps to [Disabled, PTE5]
//   <o> SPI1_PCS2 Pin Selection [PTE5] 
//   <i> Selects which pin is used for SPI1_PCS2
//     <0=> Disabled
//     <1=> PTE5
//     <0=> Default
#define SPI1_PCS2_SEL        0                   

// SPI1_PCS3 maps to [Disabled, PTE6]
//   <o> SPI1_PCS3 Pin Selection [PTE6] 
//   <i> Selects which pin is used for SPI1_PCS3
//     <0=> Disabled
//     <1=> PTE6
//     <0=> Default
#define SPI1_PCS3_SEL        0                   

// SPI1_SCK maps to [Disabled, PTB11, PTD5, PTE2]
//   <o> SPI1_SCK Pin Selection [PTB11(A3), PTD5(nRF24L01_sck), PTE2] 
//   <i> Selects which pin is used for SPI1_SCK
//     <0=> Disabled
//     <1=> PTB11 (Alias: A3)
//     <2=> PTD5 (Alias: nRF24L01_sck)
//     <3=> PTE2
//     <2=> Default
#define SPI1_SCK_SEL         2                   

// SPI1_SIN maps to [Disabled, PTB17, PTD7, PTE1, PTE3]
//   <o> SPI1_SIN Pin Selection [PTB17, PTD7(nRF24L01_miso), PTE1, PTE3] 
//   <i> Selects which pin is used for SPI1_SIN
//     <0=> Disabled
//     <1=> PTB17
//     <2=> PTD7 (Alias: nRF24L01_miso)
//     <3=> PTE1
//     <4=> PTE3
//     <2=> Default
#define SPI1_SIN_SEL         2                   

// SPI1_SOUT maps to [Disabled, PTB16, PTD6, PTE1, PTE3]
//   <o> SPI1_SOUT Pin Selection [PTB16, PTD6(nRF24L01_mosi), PTE1, PTE3] 
//   <i> Selects which pin is used for SPI1_SOUT
//     <0=> Disabled
//     <1=> PTB16
//     <2=> PTD6 (Alias: nRF24L01_mosi)
//     <3=> PTE1
//     <4=> PTE3
//     <2=> Default
#define SPI1_SOUT_SEL        2                   

// SPI2_PCS0 maps to [Disabled, PTB20, PTD11]
//   <o> SPI2_PCS0 Pin Selection [PTB20, PTD11] 
//   <i> Selects which pin is used for SPI2_PCS0
//     <0=> Disabled
//     <1=> PTB20
//     <2=> PTD11
//     <0=> Default
#define SPI2_PCS0_SEL        0                   

// SPI2_PCS1 maps to [Disabled, PTD15]
//   <o> SPI2_PCS1 Pin Selection [PTD15] 
//   <i> Selects which pin is used for SPI2_PCS1
//     <0=> Disabled
//     <1=> PTD15
//     <0=> Default
#define SPI2_PCS1_SEL        0                   

// SPI2_SCK maps to [Disabled, PTB21, PTD12]
//   <o> SPI2_SCK Pin Selection [PTB21, PTD12] 
//   <i> Selects which pin is used for SPI2_SCK
//     <0=> Disabled
//     <1=> PTB21
//     <2=> PTD12
//     <1=> Default
#define SPI2_SCK_SEL         1                   

// SPI2_SIN maps to [Disabled, PTB23, PTD14]
//   <o> SPI2_SIN Pin Selection [PTB23(D4), PTD14] 
//   <i> Selects which pin is used for SPI2_SIN
//     <0=> Disabled
//     <1=> PTB23 (Alias: D4)
//     <2=> PTD14
//     <1=> Default
#define SPI2_SIN_SEL         1                   

// SPI2_SOUT maps to [Disabled, PTB22, PTD13]
//   <o> SPI2_SOUT Pin Selection [PTB22, PTD13] 
//   <i> Selects which pin is used for SPI2_SOUT
//     <0=> Disabled
//     <1=> PTB22
//     <2=> PTD13
//     <1=> Default
#define SPI2_SOUT_SEL        1                   

// ADC0_DM0

// ADC0_DM1

// ADC0_DP0

// ADC0_DP1

// ADC0_SE16 = ADC0_21
#define ADC0_SE16_ADC_NUM          0     //!< ADC0_SE16 ADC number
#define ADC0_SE16_ADC_CH           21    //!< ADC0_SE16 ADC channel

// ADC0_SE23 = ADC0_23
#define ADC0_SE23_ADC_NUM          0     //!< ADC0_SE23 ADC number
#define ADC0_SE23_ADC_CH           23    //!< ADC0_SE23 ADC channel

// ADC1_DM0

// ADC1_DM1

// ADC1_DP0

// ADC1_DP1

// ADC1_SE16 = ADC0_22
#define ADC1_SE16_ADC_NUM          0     //!< ADC1_SE16 ADC number
#define ADC1_SE16_ADC_CH           22    //!< ADC1_SE16 ADC channel

// ADC1_SE18 = ADC1_18
#define ADC1_SE18_ADC_NUM          1     //!< ADC1_SE18 ADC number
#define ADC1_SE18_ADC_CH           18    //!< ADC1_SE18 ADC channel

// ADC1_SE23 = ADC1_23
#define ADC1_SE23_ADC_NUM          1     //!< ADC1_SE23 ADC number
#define ADC1_SE23_ADC_CH           23    //!< ADC1_SE23 ADC channel

// PTA0 = FTM0_5 (Alias: D8)
#define PTA0_PORT                  A     //!< PTA0 Port name
#define PTA0_NUM                   0     //!< PTA0 Port number
#if FTM0_5_SEL == 1
#define PTA0_FTM_NUM               0     //!< PTA0 FTM number
#define PTA0_FTM_CH                5     //!< PTA0 FTM channel
#define PTA0_FTM_FN                3     //!< PTA0 Pin multiplexor for FTM
#endif

// PTA1 = FTM0_6 (Alias: D3)
#define PTA1_PORT                  A     //!< PTA1 Port name
#define PTA1_NUM                   1     //!< PTA1 Port number
#if FTM0_6_SEL == 1
#define PTA1_FTM_NUM               0     //!< PTA1 FTM number
#define PTA1_FTM_CH                6     //!< PTA1 FTM channel
#define PTA1_FTM_FN                3     //!< PTA1 Pin multiplexor for FTM
#endif

