podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK64F12.h
// PTA2 = FTM0_7 (Alias: D5)
#define PTA2_PORT                  A     //!< PTA2 Port name
#define PTA2_NUM                   2     //!< PTA2 Port number
#if FTM0_7_SEL == 1
#define PTA2_FTM_NUM               0     //!< PTA2 FTM number
#define PTA2_FTM_CH                7     //!< PTA2 FTM channel
#define PTA2_FTM_FN                3     //!< PTA2 Pin multiplexor for FTM
#endif

// PTA3 = FTM0_0
#define PTA3_PORT                  A     //!< PTA3 Port name
#define PTA3_NUM                   3     //!< PTA3 Port number
#if FTM0_0_SEL == 1
#define PTA3_FTM_NUM               0     //!< PTA3 FTM number
#define PTA3_FTM_CH                0     //!< PTA3 FTM channel
#define PTA3_FTM_FN                3     //!< PTA3 Pin multiplexor for FTM
#endif

// PTA4 = FTM0_1
#define PTA4_PORT                  A     //!< PTA4 Port name
#define PTA4_NUM                   4     //!< PTA4 Port number
#if FTM0_1_SEL == 1
#define PTA4_FTM_NUM               0     //!< PTA4 FTM number
#define PTA4_FTM_CH                1     //!< PTA4 FTM channel
#define PTA4_FTM_FN                3     //!< PTA4 Pin multiplexor for FTM
#endif

// PTA5 = FTM0_2
#define PTA5_PORT                  A     //!< PTA5 Port name
#define PTA5_NUM                   5     //!< PTA5 Port number
#if FTM0_2_SEL == 1
#define PTA5_FTM_NUM               0     //!< PTA5 FTM number
#define PTA5_FTM_CH                2     //!< PTA5 FTM channel
#define PTA5_FTM_FN                3     //!< PTA5 Pin multiplexor for FTM
#endif

// PTA6 = FTM0_3
#define PTA6_PORT                  A     //!< PTA6 Port name
#define PTA6_NUM                   6     //!< PTA6 Port number
#if FTM0_3_SEL == 1
#define PTA6_FTM_NUM               0     //!< PTA6 FTM number
#define PTA6_FTM_CH                3     //!< PTA6 FTM channel
#define PTA6_FTM_FN                3     //!< PTA6 Pin multiplexor for FTM
#endif

// PTA7 = ADC0_10,FTM0_4
#define PTA7_PORT                  A     //!< PTA7 Port name
#define PTA7_NUM                   7     //!< PTA7 Port number
#define PTA7_ADC_NUM               0     //!< PTA7 ADC number
#define PTA7_ADC_CH                10    //!< PTA7 ADC channel
#if FTM0_4_SEL == 1
#define PTA7_FTM_NUM               0     //!< PTA7 FTM number
#define PTA7_FTM_CH                4     //!< PTA7 FTM channel
#define PTA7_FTM_FN                3     //!< PTA7 Pin multiplexor for FTM
#endif

// PTA8 = ADC0_11,FTM1_0
#define PTA8_PORT                  A     //!< PTA8 Port name
#define PTA8_NUM                   8     //!< PTA8 Port number
#define PTA8_ADC_NUM               0     //!< PTA8 ADC number
#define PTA8_ADC_CH                11    //!< PTA8 ADC channel
#if FTM1_0_SEL == 1
#define PTA8_FTM_NUM               1     //!< PTA8 FTM number
#define PTA8_FTM_CH                0     //!< PTA8 FTM channel
#define PTA8_FTM_FN                3     //!< PTA8 Pin multiplexor for FTM
#endif

// PTA9 = FTM1_1
#define PTA9_PORT                  A     //!< PTA9 Port name
#define PTA9_NUM                   9     //!< PTA9 Port number
#if FTM1_1_SEL == 1
#define PTA9_FTM_NUM               1     //!< PTA9 FTM number
#define PTA9_FTM_CH                1     //!< PTA9 FTM channel
#define PTA9_FTM_FN                3     //!< PTA9 Pin multiplexor for FTM
#endif

// PTA10 = FTM2_0
#define PTA10_PORT                 A     //!< PTA10 Port name
#define PTA10_NUM                  10    //!< PTA10 Port number
#if FTM2_0_SEL == 1
#define PTA10_FTM_NUM              2     //!< PTA10 FTM number
#define PTA10_FTM_CH               0     //!< PTA10 FTM channel
#define PTA10_FTM_FN               3     //!< PTA10 Pin multiplexor for FTM
#endif

// PTA11 = FTM2_1,I2C2_SDA
#define PTA11_PORT                 A     //!< PTA11 Port name
#define PTA11_NUM                  11    //!< PTA11 Port number
#if FTM2_1_SEL == 1
#define PTA11_FTM_NUM              2     //!< PTA11 FTM number
#define PTA11_FTM_CH               1     //!< PTA11 FTM channel
#define PTA11_FTM_FN               3     //!< PTA11 Pin multiplexor for FTM
#endif
#if I2C2_SDA_SEL == 1
#define I2C2_SDA_FN                5     //!< Pin multiplexor for I2C
#define I2C2_SDA_GPIO              digitalIO_PTA11  //!< PTA11 = I2C
#endif

// PTA12 = FTM1_0,I2C2_SCL
#define PTA12_PORT                 A     //!< PTA12 Port name
#define PTA12_NUM                  12    //!< PTA12 Port number
#if FTM1_0_SEL == 2
#define PTA12_FTM_NUM              1     //!< PTA12 FTM number
#define PTA12_FTM_CH               0     //!< PTA12 FTM channel
#define PTA12_FTM_FN               3     //!< PTA12 Pin multiplexor for FTM
#endif
#if I2C2_SCL_SEL == 1
#define I2C2_SCL_FN                5     //!< Pin multiplexor for I2C
#define I2C2_SCL_GPIO              digitalIO_PTA12  //!< PTA12 = I2C
#endif

// PTA13 = FTM1_1,I2C2_SDA
#define PTA13_PORT                 A     //!< PTA13 Port name
#define PTA13_NUM                  13    //!< PTA13 Port number
#if FTM1_1_SEL == 2
#define PTA13_FTM_NUM              1     //!< PTA13 FTM number
#define PTA13_FTM_CH               1     //!< PTA13 FTM channel
#define PTA13_FTM_FN               3     //!< PTA13 Pin multiplexor for FTM
#endif
#if I2C2_SDA_SEL == 2
#define I2C2_SDA_FN                5     //!< Pin multiplexor for I2C
#define I2C2_SDA_GPIO              digitalIO_PTA13  //!< PTA13 = I2C
#endif

// PTA14 = SPI0_PCS0,I2C2_SCL
#define PTA14_PORT                 A     //!< PTA14 Port name
#define PTA14_NUM                  14    //!< PTA14 Port number
#if SPI0_PCS0_SEL == 1
#define SPI0_PCS0_FN               2     //!< PTA14 Pin multiplexor for SPI
#define SPI0_PCS0_GPIO             digitalIO_PTA14  //!< PTA14 = SPI
#endif
#if I2C2_SCL_SEL == 2
#define I2C2_SCL_FN                5     //!< Pin multiplexor for I2C
#define I2C2_SCL_GPIO              digitalIO_PTA14  //!< PTA14 = I2C
#endif

// PTA15 = SPI0_SCK
#define PTA15_PORT                 A     //!< PTA15 Port name
#define PTA15_NUM                  15    //!< PTA15 Port number
#if SPI0_SCK_SEL == 1
#define SPI0_SCK_FN                2     //!< PTA15 Pin multiplexor for SPI
#define SPI0_SCK_GPIO              digitalIO_PTA15  //!< PTA15 = SPI
#endif

