podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK64F12.h
// PTA16 = SPI0_SOUT
#define PTA16_PORT                 A     //!< PTA16 Port name
#define PTA16_NUM                  16    //!< PTA16 Port number
#if SPI0_SOUT_SEL == 1
#define SPI0_SOUT_FN               2     //!< PTA16 Pin multiplexor for SPI
#define SPI0_SOUT_GPIO             digitalIO_PTA16  //!< PTA16 = SPI
#endif

// PTA17 = ADC1_17,SPI0_SIN
#define PTA17_PORT                 A     //!< PTA17 Port name
#define PTA17_NUM                  17    //!< PTA17 Port number
#define PTA17_ADC_NUM              1     //!< PTA17 ADC number
#define PTA17_ADC_CH               17    //!< PTA17 ADC channel
#if SPI0_SIN_SEL == 1
#define SPI0_SIN_FN                2     //!< PTA17 Pin multiplexor for SPI
#define SPI0_SIN_GPIO              digitalIO_PTA17  //!< PTA17 = SPI
#endif

// PTA18
#define PTA18_PORT                 A     //!< PTA18 Port name
#define PTA18_NUM                  18    //!< PTA18 Port number

// PTA19
#define PTA19_PORT                 A     //!< PTA19 Port name
#define PTA19_NUM                  19    //!< PTA19 Port number

// PTA24
#define PTA24_PORT                 A     //!< PTA24 Port name
#define PTA24_NUM                  24    //!< PTA24 Port number

// PTA25
#define PTA25_PORT                 A     //!< PTA25 Port name
#define PTA25_NUM                  25    //!< PTA25 Port number

// PTA26
#define PTA26_PORT                 A     //!< PTA26 Port name
#define PTA26_NUM                  26    //!< PTA26 Port number

// PTA27
#define PTA27_PORT                 A     //!< PTA27 Port name
#define PTA27_NUM                  27    //!< PTA27 Port number

// PTA28
#define PTA28_PORT                 A     //!< PTA28 Port name
#define PTA28_NUM                  28    //!< PTA28 Port number

// PTA29
#define PTA29_PORT                 A     //!< PTA29 Port name
#define PTA29_NUM                  29    //!< PTA29 Port number

// PTB0 = ADC1_8,FTM1_0,I2C0_SCL
#define PTB0_PORT                  B     //!< PTB0 Port name
#define PTB0_NUM                   0     //!< PTB0 Port number
#define PTB0_ADC_NUM               1     //!< PTB0 ADC number
#define PTB0_ADC_CH                8     //!< PTB0 ADC channel
#if FTM1_0_SEL == 3
#define PTB0_FTM_NUM               1     //!< PTB0 FTM number
#define PTB0_FTM_CH                0     //!< PTB0 FTM channel
#define PTB0_FTM_FN                3     //!< PTB0 Pin multiplexor for FTM
#endif
#if I2C0_SCL_SEL == 1
#define I2C0_SCL_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SCL_GPIO              digitalIO_PTB0  //!< PTB0 = I2C
#endif

// PTB1 = ADC1_9,FTM1_1,I2C0_SDA
#define PTB1_PORT                  B     //!< PTB1 Port name
#define PTB1_NUM                   1     //!< PTB1 Port number
#define PTB1_ADC_NUM               1     //!< PTB1 ADC number
#define PTB1_ADC_CH                9     //!< PTB1 ADC channel
#if FTM1_1_SEL == 3
#define PTB1_FTM_NUM               1     //!< PTB1 FTM number
#define PTB1_FTM_CH                1     //!< PTB1 FTM channel
#define PTB1_FTM_FN                3     //!< PTB1 Pin multiplexor for FTM
#endif
#if I2C0_SDA_SEL == 1
#define I2C0_SDA_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SDA_GPIO              digitalIO_PTB1  //!< PTB1 = I2C
#endif

// PTB2 = ADC0_12,I2C0_SCL (Alias: A0)
#define PTB2_PORT                  B     //!< PTB2 Port name
#define PTB2_NUM                   2     //!< PTB2 Port number
#define PTB2_ADC_NUM               0     //!< PTB2 ADC number
#define PTB2_ADC_CH                12    //!< PTB2 ADC channel
#if I2C0_SCL_SEL == 2
#define I2C0_SCL_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SCL_GPIO              digitalIO_PTB2  //!< PTB2 = I2C
#endif

// PTB3 = ADC0_13,I2C0_SDA (Alias: A1)
#define PTB3_PORT                  B     //!< PTB3 Port name
#define PTB3_NUM                   3     //!< PTB3 Port number
#define PTB3_ADC_NUM               0     //!< PTB3 ADC number
#define PTB3_ADC_CH                13    //!< PTB3 ADC channel
#if I2C0_SDA_SEL == 2
#define I2C0_SDA_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SDA_GPIO              digitalIO_PTB3  //!< PTB3 = I2C
#endif

// PTB4 = ADC1_10
#define PTB4_PORT                  B     //!< PTB4 Port name
#define PTB4_NUM                   4     //!< PTB4 Port number
#define PTB4_ADC_NUM               1     //!< PTB4 ADC number
#define PTB4_ADC_CH                10    //!< PTB4 ADC channel

// PTB5 = ADC1_11
#define PTB5_PORT                  B     //!< PTB5 Port name
#define PTB5_NUM                   5     //!< PTB5 Port number
#define PTB5_ADC_NUM               1     //!< PTB5 ADC number
#define PTB5_ADC_CH                11    //!< PTB5 ADC channel

// PTB6 = ADC1_12
#define PTB6_PORT                  B     //!< PTB6 Port name
#define PTB6_NUM                   6     //!< PTB6 Port number
#define PTB6_ADC_NUM               1     //!< PTB6 ADC number
#define PTB6_ADC_CH                12    //!< PTB6 ADC channel

// PTB7 = ADC1_13
#define PTB7_PORT                  B     //!< PTB7 Port name
#define PTB7_NUM                   7     //!< PTB7 Port number
#define PTB7_ADC_NUM               1     //!< PTB7 ADC number
#define PTB7_ADC_CH                13    //!< PTB7 ADC channel

// PTB8
#define PTB8_PORT                  B     //!< PTB8 Port name
#define PTB8_NUM                   8     //!< PTB8 Port number

// PTB9 = SPI1_PCS1 (Alias: D2)
#define PTB9_PORT                  B     //!< PTB9 Port name
#define PTB9_NUM                   9     //!< PTB9 Port number
#if SPI1_PCS1_SEL == 1
#define SPI1_PCS1_FN               2     //!< PTB9 Pin multiplexor for SPI
#define SPI1_PCS1_GPIO             digitalIO_PTB9  //!< PTB9 = SPI
#endif

// PTB10 = ADC1_14,SPI1_PCS0 (Alias: A2)
#define PTB10_PORT                 B     //!< PTB10 Port name
#define PTB10_NUM                  10    //!< PTB10 Port number
#define PTB10_ADC_NUM              1     //!< PTB10 ADC number
#define PTB10_ADC_CH               14    //!< PTB10 ADC channel
#if SPI1_PCS0_SEL == 1
#define SPI1_PCS0_FN               2     //!< PTB10 Pin multiplexor for SPI
#define SPI1_PCS0_GPIO             digitalIO_PTB10  //!< PTB10 = SPI
#endif

// PTB11 = ADC1_15,SPI1_SCK (Alias: A3)
#define PTB11_PORT                 B     //!< PTB11 Port name
#define PTB11_NUM                  11    //!< PTB11 Port number
#define PTB11_ADC_NUM              1     //!< PTB11 ADC number
#define PTB11_ADC_CH               15    //!< PTB11 ADC channel
#if SPI1_SCK_SEL == 1
#define SPI1_SCK_FN                2     //!< PTB11 Pin multiplexor for SPI
#define SPI1_SCK_GPIO              digitalIO_PTB11  //!< PTB11 = SPI
#endif

// PTB12 = FTM1_0,FTM0_4
#define PTB12_PORT                 B     //!< PTB12 Port name
#define PTB12_NUM                  12    //!< PTB12 Port number
#if FTM1_0_SEL == 4
#define PTB12_FTM_NUM              1     //!< PTB12 FTM number
#define PTB12_FTM_CH               0     //!< PTB12 FTM channel
#define PTB12_FTM_FN               3     //!< PTB12 Pin multiplexor for FTM
#endif
#if FTM0_4_SEL == 2
#define PTB12_FTM_NUM              0     //!< PTB12 FTM number
#define PTB12_FTM_CH               4     //!< PTB12 FTM channel
#define PTB12_FTM_FN               4     //!< PTB12 Pin multiplexor for FTM
#endif

// PTB13 = FTM1_1,FTM0_5
#define PTB13_PORT                 B     //!< PTB13 Port name
#define PTB13_NUM                  13    //!< PTB13 Port number
#if FTM1_1_SEL == 4
#define PTB13_FTM_NUM              1     //!< PTB13 FTM number
#define PTB13_FTM_CH               1     //!< PTB13 FTM channel
#define PTB13_FTM_FN               3     //!< PTB13 Pin multiplexor for FTM
#endif
#if FTM0_5_SEL == 2
#define PTB13_FTM_NUM              0     //!< PTB13 FTM number
#define PTB13_FTM_CH               5     //!< PTB13 FTM channel
#define PTB13_FTM_FN               4     //!< PTB13 Pin multiplexor for FTM
#endif

