podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK64F12.h
// PTB16 = SPI1_SOUT
#define PTB16_PORT                 B     //!< PTB16 Port name
#define PTB16_NUM                  16    //!< PTB16 Port number
#if SPI1_SOUT_SEL == 1
#define SPI1_SOUT_FN               2     //!< PTB16 Pin multiplexor for SPI
#define SPI1_SOUT_GPIO             digitalIO_PTB16  //!< PTB16 = SPI
#endif

// PTB17 = SPI1_SIN
#define PTB17_PORT                 B     //!< PTB17 Port name
#define PTB17_NUM                  17    //!< PTB17 Port number
#if SPI1_SIN_SEL == 1
#define SPI1_SIN_FN                2     //!< PTB17 Pin multiplexor for SPI
#define SPI1_SIN_GPIO              digitalIO_PTB17  //!< PTB17 = SPI
#endif

// PTB18 = FTM2_0
#define PTB18_PORT                 B     //!< PTB18 Port name
#define PTB18_NUM                  18    //!< PTB18 Port number
#if FTM2_0_SEL == 2
#define PTB18_FTM_NUM              2     //!< PTB18 FTM number
#define PTB18_FTM_CH               0     //!< PTB18 FTM channel
#define PTB18_FTM_FN               3     //!< PTB18 Pin multiplexor for FTM
#endif

// PTB19 = FTM2_1
#define PTB19_PORT                 B     //!< PTB19 Port name
#define PTB19_NUM                  19    //!< PTB19 Port number
#if FTM2_1_SEL == 2
#define PTB19_FTM_NUM              2     //!< PTB19 FTM number
#define PTB19_FTM_CH               1     //!< PTB19 FTM channel
#define PTB19_FTM_FN               3     //!< PTB19 Pin multiplexor for FTM
#endif

// PTB20 = SPI2_PCS0
#define PTB20_PORT                 B     //!< PTB20 Port name
#define PTB20_NUM                  20    //!< PTB20 Port number
#if SPI2_PCS0_SEL == 1
#define SPI2_PCS0_FN               2     //!< PTB20 Pin multiplexor for SPI
#define SPI2_PCS0_GPIO             digitalIO_PTB20  //!< PTB20 = SPI
#endif

// PTB21 = SPI2_SCK
#define PTB21_PORT                 B     //!< PTB21 Port name
#define PTB21_NUM                  21    //!< PTB21 Port number
#if SPI2_SCK_SEL == 1
#define SPI2_SCK_FN                2     //!< PTB21 Pin multiplexor for SPI
#define SPI2_SCK_GPIO              digitalIO_PTB21  //!< PTB21 = SPI
#endif

// PTB22 = SPI2_SOUT
#define PTB22_PORT                 B     //!< PTB22 Port name
#define PTB22_NUM                  22    //!< PTB22 Port number
#if SPI2_SOUT_SEL == 1
#define SPI2_SOUT_FN               2     //!< PTB22 Pin multiplexor for SPI
#define SPI2_SOUT_GPIO             digitalIO_PTB22  //!< PTB22 = SPI
#endif

// PTB23 = SPI2_SIN,SPI0_PCS5 (Alias: D4)
#define PTB23_PORT                 B     //!< PTB23 Port name
#define PTB23_NUM                  23    //!< PTB23 Port number
#if SPI2_SIN_SEL == 1
#define SPI2_SIN_FN                2     //!< PTB23 Pin multiplexor for SPI
#define SPI2_SIN_GPIO              digitalIO_PTB23  //!< PTB23 = SPI
#endif
#if SPI0_PCS5_SEL == 1
#define SPI0_PCS5_FN               3     //!< PTB23 Pin multiplexor for SPI
#define SPI0_PCS5_GPIO             digitalIO_PTB23  //!< PTB23 = SPI
#endif

// PTC0 = ADC0_14,SPI0_PCS4
#define PTC0_PORT                  C     //!< PTC0 Port name
#define PTC0_NUM                   0     //!< PTC0 Port number
#define PTC0_ADC_NUM               0     //!< PTC0 ADC number
#define PTC0_ADC_CH                14    //!< PTC0 ADC channel
#if SPI0_PCS4_SEL == 1
#define SPI0_PCS4_FN               2     //!< PTC0 Pin multiplexor for SPI
#define SPI0_PCS4_GPIO             digitalIO_PTC0  //!< PTC0 = SPI
#endif

// PTC1 = ADC0_15,FTM0_0,SPI0_PCS3
#define PTC1_PORT                  C     //!< PTC1 Port name
#define PTC1_NUM                   1     //!< PTC1 Port number
#define PTC1_ADC_NUM               0     //!< PTC1 ADC number
#define PTC1_ADC_CH                15    //!< PTC1 ADC channel
#if FTM0_0_SEL == 2
#define PTC1_FTM_NUM               0     //!< PTC1 FTM number
#define PTC1_FTM_CH                0     //!< PTC1 FTM channel
#define PTC1_FTM_FN                4     //!< PTC1 Pin multiplexor for FTM
#endif
#if SPI0_PCS3_SEL == 1
#define SPI0_PCS3_FN               2     //!< PTC1 Pin multiplexor for SPI
#define SPI0_PCS3_GPIO             digitalIO_PTC1  //!< PTC1 = SPI
#endif

// PTC2 = ADC0_4,FTM0_1,SPI0_PCS2 (Alias: D6)
#define PTC2_PORT                  C     //!< PTC2 Port name
#define PTC2_NUM                   2     //!< PTC2 Port number
#define PTC2_ADC_NUM               0     //!< PTC2 ADC number
#define PTC2_ADC_CH                4     //!< PTC2 ADC channel
#if FTM0_1_SEL == 2
#define PTC2_FTM_NUM               0     //!< PTC2 FTM number
#define PTC2_FTM_CH                1     //!< PTC2 FTM channel
#define PTC2_FTM_FN                4     //!< PTC2 Pin multiplexor for FTM
#endif
#if SPI0_PCS2_SEL == 1
#define SPI0_PCS2_FN               2     //!< PTC2 Pin multiplexor for SPI
#define SPI0_PCS2_GPIO             digitalIO_PTC2  //!< PTC2 = SPI
#endif

// PTC3 = FTM0_2,SPI0_PCS1 (Alias: D7)
#define PTC3_PORT                  C     //!< PTC3 Port name
#define PTC3_NUM                   3     //!< PTC3 Port number
#if FTM0_2_SEL == 2
#define PTC3_FTM_NUM               0     //!< PTC3 FTM number
#define PTC3_FTM_CH                2     //!< PTC3 FTM channel
#define PTC3_FTM_FN                4     //!< PTC3 Pin multiplexor for FTM
#endif
#if SPI0_PCS1_SEL == 1
#define SPI0_PCS1_FN               2     //!< PTC3 Pin multiplexor for SPI
#define SPI0_PCS1_GPIO             digitalIO_PTC3  //!< PTC3 = SPI
#endif

// PTC4 = FTM0_3,SPI0_PCS0 (Alias: D9)
#define PTC4_PORT                  C     //!< PTC4 Port name
#define PTC4_NUM                   4     //!< PTC4 Port number
#if FTM0_3_SEL == 2
#define PTC4_FTM_NUM               0     //!< PTC4 FTM number
#define PTC4_FTM_CH                3     //!< PTC4 FTM channel
#define PTC4_FTM_FN                4     //!< PTC4 Pin multiplexor for FTM
#endif
#if SPI0_PCS0_SEL == 2
#define SPI0_PCS0_FN               2     //!< PTC4 Pin multiplexor for SPI
#define SPI0_PCS0_GPIO             digitalIO_PTC4  //!< PTC4 = SPI
#endif

// PTC5 = FTM0_2,SPI0_SCK
#define PTC5_PORT                  C     //!< PTC5 Port name
#define PTC5_NUM                   5     //!< PTC5 Port number
#if FTM0_2_SEL == 3
#define PTC5_FTM_NUM               0     //!< PTC5 FTM number
#define PTC5_FTM_CH                2     //!< PTC5 FTM channel
#define PTC5_FTM_FN                7     //!< PTC5 Pin multiplexor for FTM
#endif
#if SPI0_SCK_SEL == 2
#define SPI0_SCK_FN                2     //!< PTC5 Pin multiplexor for SPI
#define SPI0_SCK_GPIO              digitalIO_PTC5  //!< PTC5 = SPI
#endif

