podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK64F12.h
// PTC6 = SPI0_SOUT
#define PTC6_PORT                  C     //!< PTC6 Port name
#define PTC6_NUM                   6     //!< PTC6 Port number
#if SPI0_SOUT_SEL == 2
#define SPI0_SOUT_FN               2     //!< PTC6 Pin multiplexor for SPI
#define SPI0_SOUT_GPIO             digitalIO_PTC6  //!< PTC6 = SPI
#endif

// PTC7 = SPI0_SIN
#define PTC7_PORT                  C     //!< PTC7 Port name
#define PTC7_NUM                   7     //!< PTC7 Port number
#if SPI0_SIN_SEL == 2
#define SPI0_SIN_FN                2     //!< PTC7 Pin multiplexor for SPI
#define SPI0_SIN_GPIO              digitalIO_PTC7  //!< PTC7 = SPI
#endif

// PTC8 = ADC1_4,FTM3_4
#define PTC8_PORT                  C     //!< PTC8 Port name
#define PTC8_NUM                   8     //!< PTC8 Port number
#define PTC8_ADC_NUM               1     //!< PTC8 ADC number
#define PTC8_ADC_CH                4     //!< PTC8 ADC channel
#if FTM3_4_SEL == 1
#define PTC8_FTM_NUM               3     //!< PTC8 FTM number
#define PTC8_FTM_CH                4     //!< PTC8 FTM channel
#define PTC8_FTM_FN                3     //!< PTC8 Pin multiplexor for FTM
#endif

// PTC9 = ADC1_5,FTM3_5
#define PTC9_PORT                  C     //!< PTC9 Port name
#define PTC9_NUM                   9     //!< PTC9 Port number
#define PTC9_ADC_NUM               1     //!< PTC9 ADC number
#define PTC9_ADC_CH                5     //!< PTC9 ADC channel
#if FTM3_5_SEL == 1
#define PTC9_FTM_NUM               3     //!< PTC9 FTM number
#define PTC9_FTM_CH                5     //!< PTC9 FTM channel
#define PTC9_FTM_FN                3     //!< PTC9 Pin multiplexor for FTM
#endif

// PTC10 = ADC1_6,FTM3_6,I2C1_SCL (Alias: A5)
#define PTC10_PORT                 C     //!< PTC10 Port name
#define PTC10_NUM                  10    //!< PTC10 Port number
#define PTC10_ADC_NUM              1     //!< PTC10 ADC number
#define PTC10_ADC_CH               6     //!< PTC10 ADC channel
#if FTM3_6_SEL == 1
#define PTC10_FTM_NUM              3     //!< PTC10 FTM number
#define PTC10_FTM_CH               6     //!< PTC10 FTM channel
#define PTC10_FTM_FN               3     //!< PTC10 Pin multiplexor for FTM
#endif
#if I2C1_SCL_SEL == 1
#define I2C1_SCL_FN                2     //!< Pin multiplexor for I2C
#define I2C1_SCL_GPIO              digitalIO_PTC10  //!< PTC10 = I2C
#endif

// PTC11 = ADC1_7,FTM3_7,I2C1_SDA (Alias: A4)
#define PTC11_PORT                 C     //!< PTC11 Port name
#define PTC11_NUM                  11    //!< PTC11 Port number
#define PTC11_ADC_NUM              1     //!< PTC11 ADC number
#define PTC11_ADC_CH               7     //!< PTC11 ADC channel
#if FTM3_7_SEL == 1
#define PTC11_FTM_NUM              3     //!< PTC11 FTM number
#define PTC11_FTM_CH               7     //!< PTC11 FTM channel
#define PTC11_FTM_FN               3     //!< PTC11 Pin multiplexor for FTM
#endif
#if I2C1_SDA_SEL == 1
#define I2C1_SDA_FN                2     //!< Pin multiplexor for I2C
#define I2C1_SDA_GPIO              digitalIO_PTC11  //!< PTC11 = I2C
#endif

// PTC12
#define PTC12_PORT                 C     //!< PTC12 Port name
#define PTC12_NUM                  12    //!< PTC12 Port number

// PTC13
#define PTC13_PORT                 C     //!< PTC13 Port name
#define PTC13_NUM                  13    //!< PTC13 Port number

// PTC14
#define PTC14_PORT                 C     //!< PTC14 Port name
#define PTC14_NUM                  14    //!< PTC14 Port number

// PTC15
#define PTC15_PORT                 C     //!< PTC15 Port name
#define PTC15_NUM                  15    //!< PTC15 Port number

// PTC16 (Alias: D0)
#define PTC16_PORT                 C     //!< PTC16 Port name
#define PTC16_NUM                  16    //!< PTC16 Port number

// PTC17 (Alias: D1)
#define PTC17_PORT                 C     //!< PTC17 Port name
#define PTC17_NUM                  17    //!< PTC17 Port number

// PTC18
#define PTC18_PORT                 C     //!< PTC18 Port name
#define PTC18_NUM                  18    //!< PTC18 Port number

// PTC19
#define PTC19_PORT                 C     //!< PTC19 Port name
#define PTC19_NUM                  19    //!< PTC19 Port number

// PTD0 = FTM3_0,SPI0_PCS0 (Alias: D10)
#define PTD0_PORT                  D     //!< PTD0 Port name
#define PTD0_NUM                   0     //!< PTD0 Port number
#if FTM3_0_SEL == 1
#define PTD0_FTM_NUM               3     //!< PTD0 FTM number
#define PTD0_FTM_CH                0     //!< PTD0 FTM channel
#define PTD0_FTM_FN                4     //!< PTD0 Pin multiplexor for FTM
#endif
#if SPI0_PCS0_SEL == 3
#define SPI0_PCS0_FN               2     //!< PTD0 Pin multiplexor for SPI
#define SPI0_PCS0_GPIO             digitalIO_PTD0  //!< PTD0 = SPI
#endif

// PTD1 = ADC0_5,FTM3_1,SPI0_SCK (Alias: D13)
#define PTD1_PORT                  D     //!< PTD1 Port name
#define PTD1_NUM                   1     //!< PTD1 Port number
#define PTD1_ADC_NUM               0     //!< PTD1 ADC number
#define PTD1_ADC_CH                5     //!< PTD1 ADC channel
#if FTM3_1_SEL == 1
#define PTD1_FTM_NUM               3     //!< PTD1 FTM number
#define PTD1_FTM_CH                1     //!< PTD1 FTM channel
#define PTD1_FTM_FN                4     //!< PTD1 Pin multiplexor for FTM
#endif
#if SPI0_SCK_SEL == 3
#define SPI0_SCK_FN                2     //!< PTD1 Pin multiplexor for SPI
#define SPI0_SCK_GPIO              digitalIO_PTD1  //!< PTD1 = SPI
#endif

// PTD2 = FTM3_2,SPI0_SOUT,I2C0_SCL (Alias: D11)
#define PTD2_PORT                  D     //!< PTD2 Port name
#define PTD2_NUM                   2     //!< PTD2 Port number
#if FTM3_2_SEL == 1
#define PTD2_FTM_NUM               3     //!< PTD2 FTM number
#define PTD2_FTM_CH                2     //!< PTD2 FTM channel
#define PTD2_FTM_FN                4     //!< PTD2 Pin multiplexor for FTM
#endif
#if SPI0_SOUT_SEL == 3
#define SPI0_SOUT_FN               2     //!< PTD2 Pin multiplexor for SPI
#define SPI0_SOUT_GPIO             digitalIO_PTD2  //!< PTD2 = SPI
#endif
#if I2C0_SCL_SEL == 3
#define I2C0_SCL_FN                7     //!< Pin multiplexor for I2C
#define I2C0_SCL_GPIO              digitalIO_PTD2  //!< PTD2 = I2C
#endif

// PTD3 = FTM3_3,SPI0_SIN,I2C0_SDA (Alias: D12)
#define PTD3_PORT                  D     //!< PTD3 Port name
#define PTD3_NUM                   3     //!< PTD3 Port number
#if FTM3_3_SEL == 1
#define PTD3_FTM_NUM               3     //!< PTD3 FTM number
#define PTD3_FTM_CH                3     //!< PTD3 FTM channel
#define PTD3_FTM_FN                4     //!< PTD3 Pin multiplexor for FTM
#endif
#if SPI0_SIN_SEL == 3
#define SPI0_SIN_FN                2     //!< PTD3 Pin multiplexor for SPI
#define SPI0_SIN_GPIO              digitalIO_PTD3  //!< PTD3 = SPI
#endif
#if I2C0_SDA_SEL == 3
#define I2C0_SDA_FN                7     //!< Pin multiplexor for I2C
#define I2C0_SDA_GPIO              digitalIO_PTD3  //!< PTD3 = I2C
#endif

// PTD4 = FTM0_4,SPI0_PCS1,SPI1_PCS0 (Alias: nRF24L01_cs)
#define PTD4_PORT                  D     //!< PTD4 Port name
#define PTD4_NUM                   4     //!< PTD4 Port number
#if FTM0_4_SEL == 3
#define PTD4_FTM_NUM               0     //!< PTD4 FTM number
#define PTD4_FTM_CH                4     //!< PTD4 FTM channel
#define PTD4_FTM_FN                4     //!< PTD4 Pin multiplexor for FTM
#endif
#if SPI0_PCS1_SEL == 2
#define SPI0_PCS1_FN               2     //!< PTD4 Pin multiplexor for SPI
#define SPI0_PCS1_GPIO             digitalIO_PTD4  //!< PTD4 = SPI
#endif
#if SPI1_PCS0_SEL == 2
#define SPI1_PCS0_FN               7     //!< PTD4 Pin multiplexor for SPI
#define SPI1_PCS0_GPIO             digitalIO_PTD4  //!< PTD4 = SPI
#endif

// PTD5 = ADC0_6,FTM0_5,SPI0_PCS2,SPI1_SCK (Alias: nRF24L01_sck)
#define PTD5_PORT                  D     //!< PTD5 Port name
#define PTD5_NUM                   5     //!< PTD5 Port number
#define PTD5_ADC_NUM               0     //!< PTD5 ADC number
#define PTD5_ADC_CH                6     //!< PTD5 ADC channel
#if FTM0_5_SEL == 3
#define PTD5_FTM_NUM               0     //!< PTD5 FTM number
#define PTD5_FTM_CH                5     //!< PTD5 FTM channel
#define PTD5_FTM_FN                4     //!< PTD5 Pin multiplexor for FTM
#endif
#if SPI0_PCS2_SEL == 2
#define SPI0_PCS2_FN               2     //!< PTD5 Pin multiplexor for SPI
#define SPI0_PCS2_GPIO             digitalIO_PTD5  //!< PTD5 = SPI
#endif
#if SPI1_SCK_SEL == 2
#define SPI1_SCK_FN                7     //!< PTD5 Pin multiplexor for SPI
#define SPI1_SCK_GPIO              digitalIO_PTD5  //!< PTD5 = SPI
#endif

// PTD6 = ADC0_7,FTM0_6,SPI0_PCS3,SPI1_SOUT (Alias: nRF24L01_mosi)
#define PTD6_PORT                  D     //!< PTD6 Port name
#define PTD6_NUM                   6     //!< PTD6 Port number
#define PTD6_ADC_NUM               0     //!< PTD6 ADC number
#define PTD6_ADC_CH                7     //!< PTD6 ADC channel
#if FTM0_6_SEL == 2
#define PTD6_FTM_NUM               0     //!< PTD6 FTM number
#define PTD6_FTM_CH                6     //!< PTD6 FTM channel
#define PTD6_FTM_FN                4     //!< PTD6 Pin multiplexor for FTM
#endif
#if SPI0_PCS3_SEL == 2
#define SPI0_PCS3_FN               2     //!< PTD6 Pin multiplexor for SPI
#define SPI0_PCS3_GPIO             digitalIO_PTD6  //!< PTD6 = SPI
#endif
#if SPI1_SOUT_SEL == 2
#define SPI1_SOUT_FN               7     //!< PTD6 Pin multiplexor for SPI
#define SPI1_SOUT_GPIO             digitalIO_PTD6  //!< PTD6 = SPI
#endif

// PTD7 = FTM0_7,SPI1_SIN (Alias: nRF24L01_miso)
#define PTD7_PORT                  D     //!< PTD7 Port name
#define PTD7_NUM                   7     //!< PTD7 Port number
#if FTM0_7_SEL == 2
#define PTD7_FTM_NUM               0     //!< PTD7 FTM number
#define PTD7_FTM_CH                7     //!< PTD7 FTM channel
#define PTD7_FTM_FN                4     //!< PTD7 Pin multiplexor for FTM
#endif
#if SPI1_SIN_SEL == 2
#define SPI1_SIN_FN                7     //!< PTD7 Pin multiplexor for SPI
#define SPI1_SIN_GPIO              digitalIO_PTD7  //!< PTD7 = SPI
#endif

// PTD8 = I2C0_SCL
#define PTD8_PORT                  D     //!< PTD8 Port name
#define PTD8_NUM                   8     //!< PTD8 Port number
#if I2C0_SCL_SEL == 4
#define I2C0_SCL_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SCL_GPIO              digitalIO_PTD8  //!< PTD8 = I2C
#endif

