podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK64F12.h
// PTD9 = I2C0_SDA
#define PTD9_PORT                  D     //!< PTD9 Port name
#define PTD9_NUM                   9     //!< PTD9 Port number
#if I2C0_SDA_SEL == 4
#define I2C0_SDA_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SDA_GPIO              digitalIO_PTD9  //!< PTD9 = I2C
#endif

// PTD10
#define PTD10_PORT                 D     //!< PTD10 Port name
#define PTD10_NUM                  10    //!< PTD10 Port number

// PTD11 = SDHC0_CLKIN,SPI2_PCS0
#define PTD11_PORT                 D     //!< PTD11 Port name
#define PTD11_NUM                  11    //!< PTD11 Port number
#if SPI2_PCS0_SEL == 2
#define SPI2_PCS0_FN               2     //!< PTD11 Pin multiplexor for SPI
#define SPI2_PCS0_GPIO             digitalIO_PTD11  //!< PTD11 = SPI
#endif
#define SDHC0_CLKIN_FN             4     //!< PTD11 Pin multiplexor for SDHC
#define SDHC0_CLKIN_GPIO           digitalIO_PTD11  //!< PTD11 = SDHC

// PTD12 = SDHC0_D4,SPI2_SCK
#define PTD12_PORT                 D     //!< PTD12 Port name
#define PTD12_NUM                  12    //!< PTD12 Port number
#if SPI2_SCK_SEL == 2
#define SPI2_SCK_FN                2     //!< PTD12 Pin multiplexor for SPI
#define SPI2_SCK_GPIO              digitalIO_PTD12  //!< PTD12 = SPI
#endif
#define SDHC0_D4_FN                4     //!< PTD12 Pin multiplexor for SDHC
#define SDHC0_D4_GPIO              digitalIO_PTD12  //!< PTD12 = SDHC

// PTD13 = SDHC0_D5,SPI2_SOUT
#define PTD13_PORT                 D     //!< PTD13 Port name
#define PTD13_NUM                  13    //!< PTD13 Port number
#if SPI2_SOUT_SEL == 2
#define SPI2_SOUT_FN               2     //!< PTD13 Pin multiplexor for SPI
#define SPI2_SOUT_GPIO             digitalIO_PTD13  //!< PTD13 = SPI
#endif
#define SDHC0_D5_FN                4     //!< PTD13 Pin multiplexor for SDHC
#define SDHC0_D5_GPIO              digitalIO_PTD13  //!< PTD13 = SDHC

// PTD14 = SDHC0_D6,SPI2_SIN
#define PTD14_PORT                 D     //!< PTD14 Port name
#define PTD14_NUM                  14    //!< PTD14 Port number
#if SPI2_SIN_SEL == 2
#define SPI2_SIN_FN                2     //!< PTD14 Pin multiplexor for SPI
#define SPI2_SIN_GPIO              digitalIO_PTD14  //!< PTD14 = SPI
#endif
#define SDHC0_D6_FN                4     //!< PTD14 Pin multiplexor for SDHC
#define SDHC0_D6_GPIO              digitalIO_PTD14  //!< PTD14 = SDHC

// PTD15 = SDHC0_D7,SPI2_PCS1
#define PTD15_PORT                 D     //!< PTD15 Port name
#define PTD15_NUM                  15    //!< PTD15 Port number
#if SPI2_PCS1_SEL == 1
#define SPI2_PCS1_FN               2     //!< PTD15 Pin multiplexor for SPI
#define SPI2_PCS1_GPIO             digitalIO_PTD15  //!< PTD15 = SPI
#endif
#define SDHC0_D7_FN                4     //!< PTD15 Pin multiplexor for SDHC
#define SDHC0_D7_GPIO              digitalIO_PTD15  //!< PTD15 = SDHC

// PTE0 = SDHC0_D1,SPI1_PCS1,I2C1_SDA
#define PTE0_PORT                  E     //!< PTE0 Port name
#define PTE0_NUM                   0     //!< PTE0 Port number
#if SPI1_PCS1_SEL == 2
#define SPI1_PCS1_FN               2     //!< PTE0 Pin multiplexor for SPI
#define SPI1_PCS1_GPIO             digitalIO_PTE0  //!< PTE0 = SPI
#endif
#if I2C1_SDA_SEL == 2
#define I2C1_SDA_FN                6     //!< Pin multiplexor for I2C
#define I2C1_SDA_GPIO              digitalIO_PTE0  //!< PTE0 = I2C
#endif
#define SDHC0_D1_FN                4     //!< PTE0 Pin multiplexor for SDHC
#define SDHC0_D1_GPIO              digitalIO_PTE0  //!< PTE0 = SDHC

// PTE1 = SDHC0_D0,SPI1_SOUT,SPI1_SIN,I2C1_SCL
#define PTE1_PORT                  E     //!< PTE1 Port name
#define PTE1_NUM                   1     //!< PTE1 Port number
#if SPI1_SOUT_SEL == 3
#define SPI1_SOUT_FN               2     //!< PTE1 Pin multiplexor for SPI
#define SPI1_SOUT_GPIO             digitalIO_PTE1  //!< PTE1 = SPI
#endif
#if SPI1_SIN_SEL == 3
#define SPI1_SIN_FN                7     //!< PTE1 Pin multiplexor for SPI
#define SPI1_SIN_GPIO              digitalIO_PTE1  //!< PTE1 = SPI
#endif
#if I2C1_SCL_SEL == 2
#define I2C1_SCL_FN                6     //!< Pin multiplexor for I2C
#define I2C1_SCL_GPIO              digitalIO_PTE1  //!< PTE1 = I2C
#endif
#define SDHC0_D0_FN                4     //!< PTE1 Pin multiplexor for SDHC
#define SDHC0_D0_GPIO              digitalIO_PTE1  //!< PTE1 = SDHC

// PTE2 = SDHC0_DCLK,SPI1_SCK
#define PTE2_PORT                  E     //!< PTE2 Port name
#define PTE2_NUM                   2     //!< PTE2 Port number
#if SPI1_SCK_SEL == 3
#define SPI1_SCK_FN                2     //!< PTE2 Pin multiplexor for SPI
#define SPI1_SCK_GPIO              digitalIO_PTE2  //!< PTE2 = SPI
#endif
#define SDHC0_DCLK_FN              4     //!< PTE2 Pin multiplexor for SDHC
#define SDHC0_DCLK_GPIO            digitalIO_PTE2  //!< PTE2 = SDHC

// PTE3 = SDHC0_CMD,SPI1_SIN,SPI1_SOUT
#define PTE3_PORT                  E     //!< PTE3 Port name
#define PTE3_NUM                   3     //!< PTE3 Port number
#if SPI1_SIN_SEL == 4
#define SPI1_SIN_FN                2     //!< PTE3 Pin multiplexor for SPI
#define SPI1_SIN_GPIO              digitalIO_PTE3  //!< PTE3 = SPI
#endif
#if SPI1_SOUT_SEL == 4
#define SPI1_SOUT_FN               7     //!< PTE3 Pin multiplexor for SPI
#define SPI1_SOUT_GPIO             digitalIO_PTE3  //!< PTE3 = SPI
#endif
#define SDHC0_CMD_FN               4     //!< PTE3 Pin multiplexor for SDHC
#define SDHC0_CMD_GPIO             digitalIO_PTE3  //!< PTE3 = SDHC

// PTE4 = SDHC0_D3,SPI1_PCS0
#define PTE4_PORT                  E     //!< PTE4 Port name
#define PTE4_NUM                   4     //!< PTE4 Port number
#if SPI1_PCS0_SEL == 3
#define SPI1_PCS0_FN               2     //!< PTE4 Pin multiplexor for SPI
#define SPI1_PCS0_GPIO             digitalIO_PTE4  //!< PTE4 = SPI
#endif
#define SDHC0_D3_FN                4     //!< PTE4 Pin multiplexor for SDHC
#define SDHC0_D3_GPIO              digitalIO_PTE4  //!< PTE4 = SDHC

// PTE5 = FTM3_0,SDHC0_D2,SPI1_PCS2
#define PTE5_PORT                  E     //!< PTE5 Port name
#define PTE5_NUM                   5     //!< PTE5 Port number
#if FTM3_0_SEL == 2
#define PTE5_FTM_NUM               3     //!< PTE5 FTM number
#define PTE5_FTM_CH                0     //!< PTE5 FTM channel
#define PTE5_FTM_FN                6     //!< PTE5 Pin multiplexor for FTM
#endif
#if SPI1_PCS2_SEL == 1
#define SPI1_PCS2_FN               2     //!< PTE5 Pin multiplexor for SPI
#define SPI1_PCS2_GPIO             digitalIO_PTE5  //!< PTE5 = SPI
#endif
#define SDHC0_D2_FN                4     //!< PTE5 Pin multiplexor for SDHC
#define SDHC0_D2_GPIO              digitalIO_PTE5  //!< PTE5 = SDHC

