podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MK64F12.h
// PTE6 = FTM3_1,SPI1_PCS3
#define PTE6_PORT                  E     //!< PTE6 Port name
#define PTE6_NUM                   6     //!< PTE6 Port number
#if FTM3_1_SEL == 2
#define PTE6_FTM_NUM               3     //!< PTE6 FTM number
#define PTE6_FTM_CH                1     //!< PTE6 FTM channel
#define PTE6_FTM_FN                6     //!< PTE6 Pin multiplexor for FTM
#endif
#if SPI1_PCS3_SEL == 1
#define SPI1_PCS3_FN               2     //!< PTE6 Pin multiplexor for SPI
#define SPI1_PCS3_GPIO             digitalIO_PTE6  //!< PTE6 = SPI
#endif

// PTE7 = FTM3_2
#define PTE7_PORT                  E     //!< PTE7 Port name
#define PTE7_NUM                   7     //!< PTE7 Port number
#if FTM3_2_SEL == 2
#define PTE7_FTM_NUM               3     //!< PTE7 FTM number
#define PTE7_FTM_CH                2     //!< PTE7 FTM channel
#define PTE7_FTM_FN                6     //!< PTE7 Pin multiplexor for FTM
#endif

// PTE8 = FTM3_3
#define PTE8_PORT                  E     //!< PTE8 Port name
#define PTE8_NUM                   8     //!< PTE8 Port number
#if FTM3_3_SEL == 2
#define PTE8_FTM_NUM               3     //!< PTE8 FTM number
#define PTE8_FTM_CH                3     //!< PTE8 FTM channel
#define PTE8_FTM_FN                6     //!< PTE8 Pin multiplexor for FTM
#endif

// PTE9 = FTM3_4
#define PTE9_PORT                  E     //!< PTE9 Port name
#define PTE9_NUM                   9     //!< PTE9 Port number
#if FTM3_4_SEL == 2
#define PTE9_FTM_NUM               3     //!< PTE9 FTM number
#define PTE9_FTM_CH                4     //!< PTE9 FTM channel
#define PTE9_FTM_FN                6     //!< PTE9 Pin multiplexor for FTM
#endif

// PTE10 = FTM3_5
#define PTE10_PORT                 E     //!< PTE10 Port name
#define PTE10_NUM                  10    //!< PTE10 Port number
#if FTM3_5_SEL == 2
#define PTE10_FTM_NUM              3     //!< PTE10 FTM number
#define PTE10_FTM_CH               5     //!< PTE10 FTM channel
#define PTE10_FTM_FN               6     //!< PTE10 Pin multiplexor for FTM
#endif

// PTE11 = FTM3_6
#define PTE11_PORT                 E     //!< PTE11 Port name
#define PTE11_NUM                  11    //!< PTE11 Port number
#if FTM3_6_SEL == 2
#define PTE11_FTM_NUM              3     //!< PTE11 FTM number
#define PTE11_FTM_CH               6     //!< PTE11 FTM channel
#define PTE11_FTM_FN               6     //!< PTE11 Pin multiplexor for FTM
#endif

// PTE12 = FTM3_7
#define PTE12_PORT                 E     //!< PTE12 Port name
#define PTE12_NUM                  12    //!< PTE12 Port number
#if FTM3_7_SEL == 2
#define PTE12_FTM_NUM              3     //!< PTE12 FTM number
#define PTE12_FTM_CH               7     //!< PTE12 FTM channel
#define PTE12_FTM_FN               6     //!< PTE12 Pin multiplexor for FTM
#endif

// PTE24 = ADC0_17,I2C0_SCL (Alias: D15)
#define PTE24_PORT                 E     //!< PTE24 Port name
#define PTE24_NUM                  24    //!< PTE24 Port number
#define PTE24_ADC_NUM              0     //!< PTE24 ADC number
#define PTE24_ADC_CH               17    //!< PTE24 ADC channel
#if I2C0_SCL_SEL == 5
#define I2C0_SCL_FN                5     //!< Pin multiplexor for I2C
#define I2C0_SCL_GPIO              digitalIO_PTE24  //!< PTE24 = I2C
#endif

// PTE25 = ADC0_18,I2C0_SDA (Alias: D14)
#define PTE25_PORT                 E     //!< PTE25 Port name
#define PTE25_NUM                  25    //!< PTE25 Port number
#define PTE25_ADC_NUM              0     //!< PTE25 ADC number
#define PTE25_ADC_CH               18    //!< PTE25 ADC channel
#if I2C0_SDA_SEL == 5
#define I2C0_SDA_FN                5     //!< Pin multiplexor for I2C
#define I2C0_SDA_GPIO              digitalIO_PTE25  //!< PTE25 = I2C
#endif

// PTE26
#define PTE26_PORT                 E     //!< PTE26 Port name
#define PTE26_NUM                  26    //!< PTE26 Port number

// PTE27
#define PTE27_PORT                 E     //!< PTE27 Port name
#define PTE27_NUM                  27    //!< PTE27 Port number

// PTE28
#define PTE28_PORT                 E     //!< PTE28 Port name
#define PTE28_NUM                  28    //!< PTE28 Port number

// </h>


#endif /* PINMAPPING_H_ */
